In [4]:
%load_ext sql
%sql mysql://root:learnsql_springboard123@localhost/country_club

'Connected: root@country_club'

Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [14]:
db_query = '''
     SELECT name 
     FROM facilities 
     WHERE membercost != 0
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
5 rows affected.

[('Tennis Court 1',),
 ('Tennis Court 2',),
 ('Massage Room 1',),
 ('Massage Room 2',),
 ('Squash Court',)]

Q2: How many facilities do not charge a fee to members?

In [15]:
db_query = '''
     SELECT COUNT(*) AS no_membercost
     FROM facilities 
     WHERE membercost = 0
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
1 rows affected.

[(4,)]

Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

In [16]:
db_query = '''
     SELECT facid, name, membercost, monthlymaintenance
     FROM facilities 
     WHERE membercost < (0.2 * monthlymaintenance) 
     AND membercost != 0
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
5 rows affected.

[(0, 'Tennis Court 1', Decimal('5.0'), 200),
 (1, 'Tennis Court 2', Decimal('5.0'), 200),
 (4, 'Massage Room 1', Decimal('9.9'), 3000),
 (5, 'Massage Room 2', Decimal('9.9'), 3000),
 (6, 'Squash Court', Decimal('3.5'), 80)]

Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator.

In [17]:
db_query = '''
    SELECT * 
    FROM facilities
    WHERE facid IN (1,5)
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
2 rows affected.

[(1, 'Tennis Court 2', Decimal('5.0'), Decimal('25.0'), 8000, 200),
 (5, 'Massage Room 2', Decimal('9.9'), Decimal('80.0'), 4000, 3000)]

Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question.

In [19]:
db_query = '''
    SELECT name, monthlymaintenance,
    CASE WHEN monthlymaintenance > 100 THEN 'expensive' ELSE 'cheap' END AS price 
    FROM facilities
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
9 rows affected.

[('Tennis Court 1', 200, 'expensive'),
 ('Tennis Court 2', 200, 'expensive'),
 ('Badminton Court', 50, 'cheap'),
 ('Table Tennis', 10, 'cheap'),
 ('Massage Room 1', 3000, 'expensive'),
 ('Massage Room 2', 3000, 'expensive'),
 ('Squash Court', 80, 'cheap'),
 ('Snooker Table', 15, 'cheap'),
 ('Pool Table', 15, 'cheap')]

Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution.

In [34]:
db_query = '''
    SELECT firstname, surname, joindate
    FROM members 
    WHERE joindate = (SELECT MAX(joindate) FROM members)
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
1 rows affected.

[('Darren', 'Smith', '2012-09-26 18:08:45')]

Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name.

In [119]:
db_query = '''
    SELECT DISTINCT CONCAT(m.firstname,' ',m.surname) as member_name, f.name
    FROM bookings b
    INNER JOIN facilities f
        ON f.facid = b.facid AND f.name LIKE 'Tennis Court%'   
    JOIN members m
        ON m.memid = b.memid
    ORDER BY member_name
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
46 rows affected.

[('Anne Baker', 'Tennis Court 1'),
 ('Anne Baker', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 2'),
 ('Burton Tracy', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 1'),
 ('Charles Owen', 'Tennis Court 2'),
 ('Darren Smith', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 2'),
 ('David Farrell', 'Tennis Court 1'),
 ('David Jones', 'Tennis Court 2'),
 ('David Jones', 'Tennis Court 1'),
 ('David Pinker', 'Tennis Court 1'),
 ('Douglas Jones', 'Tennis Court 1'),
 ('Erica Crumpet', 'Tennis Court 1'),
 ('Florence Bader', 'Tennis Court 2'),
 ('Florence Bader', 'Tennis Court 1'),
 ('Gerald Butters', 'Tennis Court 2'),
 ('Gerald Butters', 'Tennis Court 1'),
 ('GUEST GUEST', 'Tennis Court 2'),
 ('GUEST GUEST', 'Tennis Court 1'),
 ('Henrietta Rumney', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 2'),
 ('Jack Smith', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 1'),
 ('Janice Joplette', 'Tennis Court 2'),
 ('Jemima Farrell', 'Tennis Court 1'),
 ('Jemima Farrell', 'Tennis Court 2'),
 ('Joan Coplin', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 1'),
 ('John Hunt', 'Tennis Court 2'),
 ('Matthew Genting', 'Tennis Court 1'),
 ('Millicent Purview', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 2'),
 ('Nancy Dare', 'Tennis Court 1'),
 ('Ponder Stibbons', 'Tennis Court 2'),
 ('Ponder Stibbons', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 1'),
 ('Ramnaresh Sarwin', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 2'),
 ('Tim Boothe', 'Tennis Court 1'),
 ('Tim Rownam', 'Tennis Court 2'),
 ('Tim Rownam', 'Tennis Court 1'),
 ('Timothy Baker', 'Tennis Court 2'),
 ('Timothy Baker', 'Tennis Court 1'),
 ('Tracy Smith', 'Tennis Court 2'),
 ('Tracy Smith', 'Tennis Court 1')]

Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries.

In [149]:
db_query = '''
    SELECT f.name AS facility_name,
           CASE WHEN m.firstname = 'GUEST' THEN m.firstname ELSE CONCAT(m.firstname,' ',m.surname) END AS member_name,
           CASE WHEN b.memid = 0 THEN (f.guestcost * b.slots) ELSE (f.membercost * b.slots) END AS booking_cost
    FROM bookings b 
    JOIN facilities f
        ON b.starttime BETWEEN '2012-09-14' AND '2012-09-15' AND b.facid = f.facid
    JOIN members m
        ON m.memid = b.memid
    HAVING booking_cost > 30
    ORDER BY booking_cost DESC
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
12 rows affected.

[('Massage Room 2', 'GUEST', Decimal('320.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Tennis Court 2', 'GUEST', Decimal('150.0')),
 ('Tennis Court 1', 'GUEST', Decimal('75.0')),
 ('Tennis Court 2', 'GUEST', Decimal('75.0')),
 ('Tennis Court 1', 'GUEST', Decimal('75.0')),
 ('Squash Court', 'GUEST', Decimal('70.0')),
 ('Massage Room 1', 'Jemima Farrell', Decimal('39.6')),
 ('Squash Court', 'GUEST', Decimal('35.0')),
 ('Squash Court', 'GUEST', Decimal('35.0'))]

Q9: This time, produce the same result as in Q8, but using a subquery.

In [148]:
db_query = ''' 
    SELECT sub.facility_name,  
           CASE WHEN m.firstname = 'GUEST' THEN m.firstname ELSE CONCAT(m.firstname,' ',m.surname) END AS member_name,
           sub.booking_cost
    FROM(  
    SELECT f.name AS facility_name,
           b. memid AS memid,
           CASE WHEN b.memid = 0 THEN (f.guestcost * b.slots) ELSE (f.membercost * b.slots) END AS booking_cost
    FROM bookings b 
    JOIN facilities f
        ON b.starttime BETWEEN '2012-09-14' AND '2012-09-15' AND b.facid = f.facid) sub
    JOIN members m
    ON m.memid = sub.memid AND sub.booking_cost >30
    ORDER BY sub.booking_cost DESC
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
12 rows affected.

[('Massage Room 2', 'GUEST', Decimal('320.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Massage Room 1', 'GUEST', Decimal('160.0')),
 ('Tennis Court 2', 'GUEST', Decimal('150.0')),
 ('Tennis Court 1', 'GUEST', Decimal('75.0')),
 ('Tennis Court 1', 'GUEST', Decimal('75.0')),
 ('Tennis Court 2', 'GUEST', Decimal('75.0')),
 ('Squash Court', 'GUEST', Decimal('70.0')),
 ('Massage Room 1', 'Jemima Farrell', Decimal('39.6')),
 ('Squash Court', 'GUEST', Decimal('35.0')),
 ('Squash Court', 'GUEST', Decimal('35.0'))]

Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [5]:
db_query = ''' 
    SELECT sub.facility_name,
           sub.total_revenue
    FROM(
    SELECT f.name AS facility_name,
           SUM(CASE WHEN b.memid = 0 THEN (f.guestcost * b.slots) ELSE (f.membercost * b.slots) END) AS total_revenue
    FROM bookings b 
    JOIN facilities f
        ON b.facid = f.facid
    GROUP BY f.name) sub
    WHERE sub.total_revenue < 1000
    ORDER BY sub.total_revenue
'''
%sql $db_query

 * mysql://root:***@localhost/country_club
3 rows affected.

[('Table Tennis', Decimal('180.0')),
 ('Snooker Table', Decimal('240.0')),
 ('Pool Table', Decimal('270.0'))]